### Terraform CI Summary

**Format & Style:** ✅ `success`  
**Initialization:** ✅ `success`  
**Validation:** ✅ `success`  
**Plan:** ✅ `success`  

<details>
<summary>Show Terraform Plan</summary>

```
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_ssh_key.k3s[0]: Refreshing state... [id=101168964][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.agent[0]: Refreshing state... [id=1126793][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.hcloud_network.k3s[0]: Refreshing state... [id=11372842][0m
[0m[1mmodule.kube-hetzner.hcloud_firewall.k3s: Refreshing state... [id=2381903][0m
[0m[1mmodule.kube-hetzner.hcloud_placement_group.control_plane[0]: Refreshing state... [id=1126792][0m
[0m[1mmodule.kube-hetzner.hcloud_load_balancer.cluster[0]: Refreshing state... [id=4309300][0m
[0m[1mmodule.kube-hetzner.data.hcloud_ssh_keys.keys_by_selector[0]: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_arm_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_image.microos_x86_snapshot: Read complete after 0s[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.hcloud_network.k3s: Read complete after 0s [name=kube-baphomet][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[0]: Refreshing state... [id=11372842-10.0.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[1]: Refreshing state... [id=11372842-10.254.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[1]: Refreshing state... [id=11372842-10.1.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[2]: Refreshing state... [id=11372842-10.253.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.agent[2]: Refreshing state... [id=11372842-10.2.0.0/16][0m
[0m[1mmodule.kube-hetzner.hcloud_network_subnet.control_plane[0]: Refreshing state... [id=11372842-10.255.0.0/16][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.identity_file: Refreshing state... [id=t1drw2ozrnyk6rlyebht][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.identity_file: Refreshing state... [id=v7wu8403jueav9ppl2cc][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.identity_file: Refreshing state... [id=6h9c40a6wuokgglmuxua][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.identity_file: Refreshing state... [id=1u3e2by65nath3xozldn][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.identity_file: Refreshing state... [id=w26v0s7hysdwe5f77kd2][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].random_string.server: Refreshing state... [id=lxe][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].random_string.server: Refreshing state... [id=wad][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.identity_file: Refreshing state... [id=eat3t8zxrpnmxn3e9ot8][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].random_string.server: Refreshing state... [id=qww][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].random_string.server: Refreshing state... [id=tfr][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].random_string.server: Refreshing state... [id=cub][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].random_string.server: Refreshing state... [id=rve][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].data.cloudinit_config.config: Read complete after 0s [id=1466179908][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].data.cloudinit_config.config: Read complete after 0s [id=2652128450][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].data.cloudinit_config.config: Read complete after 0s [id=3308093005][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server.server: Refreshing state... [id=107336946][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].data.cloudinit_config.config: Read complete after 0s [id=368258367][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server.server: Refreshing state... [id=107336945][0m
[0m[1mmodule.kube-hetzner.module.agents["1-0-worker-1"].data.cloudinit_config.config: Read complete after 0s [id=2074481616][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server.server: Refreshing state... [id=107336947][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].data.cloudinit_config.config: Read complete after 0s [id=2084143389][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server: Refreshing state... [id=107336950][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server: Refreshing state... [id=107336949][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_server_network.server: Refreshing state... [id=107336945-11372842][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.zram: Refreshing state... [id=1638155925798624546][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.zram: Refreshing state... [id=531888647499370333][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.zram: Refreshing state... [id=1678068167576324450][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].null_resource.registries: Refreshing state... [id=1370237932773304541][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_server_network.server: Refreshing state... [id=107336946-11372842][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_server_network.server: Refreshing state... [id=107336947-11372842][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].null_resource.registries: Refreshing state... [id=7226164416479625467][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].null_resource.registries: Refreshing state... [id=1445872621621939973][0m
[0m[1mmodule.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0]: Refreshing state... [id=s-107336945-188.245.148.8][0m
[0m[1mmodule.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0]: Refreshing state... [id=s-107336947-195.201.238.37][0m
[0m[1mmodule.kube-hetzner.module.control_planes["2-0-control-plane-2"].hcloud_rdns.server[0]: Refreshing state... [id=s-107336946-65.108.83.235][0m
[0m[1mmodule.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server_network.server: Refreshing state... [id=107336950-11372842][0m
[0m[1mmodule.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server_network.server: Refreshing state... [id=107336949-11372842][0m
[0m[1maws_route53_record.api_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_A][0m
[0m[1maws_route53_record.rancher_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_A][0m
[0m[1maws_route53_record.lb_ipv4: Refreshing state... [id=Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_A][0m
[0m[1maws_route53_record.lb_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_lb.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.rancher_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_rancher.baphomet.cloud_AAAA][0m
[0m[1maws_route53_record.api_ipv6: Refreshing state... [id=Z00476003F8RX1KPNHHY4_api.baphomet.cloud_AAAA][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Reading...[0m[0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_csi[0]: Read complete after 0s [id=237686054][0m
[0m[1mmodule.kube-hetzner.data.github_release.kured[0]: Read complete after 0s [id=203405526][0m
[0m[1mmodule.kube-hetzner.data.github_release.hetzner_ccm[0]: Read complete after 0s [id=229419124][0m

[1m[36mNote:[0m[1m Objects have changed outside of Terraform
[0m
Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

[1m  # module.kube-hetzner.hcloud_load_balancer.cluster[0][0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_load_balancer" "cluster" {
        id                 = "4309300"
      [31m-[0m[0m ipv4               = "91.98.13.228" [90m-> null[0m[0m
      [31m-[0m[0m ipv6               = "2a01:4f8:c01e:3ff2::1" [90m-> null[0m[0m
        name               = "kube-baphomet-nginx"
        [90m# (7 unchanged attributes hidden)[0m[0m

        [90m# (1 unchanged block hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server[0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_server" "server" {
      [31m-[0m[0m id                         = "107336949" [90m-> null[0m[0m
      [31m-[0m[0m ipv4_address               = "95.216.160.119" [90m-> null[0m[0m
      [31m-[0m[0m ipv6_address               = "2a01:4f9:c012:f19::1" [90m-> null[0m[0m
      [31m-[0m[0m name                       = "kube-baphomet-worker-0-tfr" [90m-> null[0m[0m
        [90m# (20 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server_network.server[0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_server_network" "server" {
        id          = "107336949-11372842"
      [31m-[0m[0m ip          = "10.0.0.101" [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server[0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_server" "server" {
      [31m-[0m[0m id                         = "107336950" [90m-> null[0m[0m
      [31m-[0m[0m ipv4_address               = "5.75.224.184" [90m-> null[0m[0m
      [31m-[0m[0m ipv6_address               = "2a01:4f8:c012:c0f1::1" [90m-> null[0m[0m
      [31m-[0m[0m name                       = "kube-baphomet-worker-2-cub" [90m-> null[0m[0m
        [90m# (20 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server_network.server[0m has been deleted
[0m  [31m-[0m[0m resource "hcloud_server_network" "server" {
        id          = "107336950-11372842"
      [31m-[0m[0m ip          = "10.2.0.101" [90m-> null[0m[0m
        [90m# (4 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_route53_record.api_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "api.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.api_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "api_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "api.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.lb_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "lb_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.lb_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "lb_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "lb.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_ipv4[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_ipv4" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "A"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # aws_route53_record.rancher_ipv6[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "rancher_ipv6" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "rancher.baphomet.cloud"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "AAAA"
      [32m+[0m[0m zone_id         = "Z00476003F8RX1KPNHHY4"
    }

[1m  # module.kube-hetzner.data.remote_file.kubeconfig[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "remote_file" "kubeconfig" {
      [32m+[0m[0m content     = (known after apply)
      [32m+[0m[0m group       = (known after apply)
      [32m+[0m[0m group_name  = (known after apply)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m owner       = (known after apply)
      [32m+[0m[0m owner_name  = (known after apply)
      [32m+[0m[0m path        = "/etc/rancher/k3s/k3s.yaml"
      [32m+[0m[0m permissions = (known after apply)

      [32m+[0m[0m conn {
          [32m+[0m[0m agent       = (sensitive value)
          [32m+[0m[0m host        = "195.201.238.37"
          [32m+[0m[0m port        = 22
          [32m+[0m[0m private_key = (sensitive value)
          [32m+[0m[0m user        = "root"
        }
    }

[1m  # module.kube-hetzner.hcloud_load_balancer.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_load_balancer" "cluster" {
      [32m+[0m[0m delete_protection  = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m ipv4               = (known after apply)
      [32m+[0m[0m ipv6               = (known after apply)
      [32m+[0m[0m labels             = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
        }
      [32m+[0m[0m load_balancer_type = "lb11"
      [32m+[0m[0m location           = "fsn1"
      [32m+[0m[0m name               = "kube-baphomet-nginx"
      [32m+[0m[0m network_id         = (known after apply)
      [32m+[0m[0m network_ip         = (known after apply)
      [32m+[0m[0m network_zone       = (known after apply)

      [32m+[0m[0m algorithm {
          [32m+[0m[0m type = "round_robin"
        }

      [32m+[0m[0m target (known after apply)
    }

[1m  # module.kube-hetzner.local_file.kustomization_backup[0][0m will be created
[0m  [32m+[0m[0m resource "local_file" "kustomization_backup" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0777"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kustomization_backup.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.local_sensitive_file.kubeconfig[0][0m will be created
[0m  [32m+[0m[0m resource "local_sensitive_file" "kubeconfig" {
      [32m+[0m[0m content              = (sensitive value)
      [32m+[0m[0m content_base64sha256 = (known after apply)
      [32m+[0m[0m content_base64sha512 = (known after apply)
      [32m+[0m[0m content_md5          = (known after apply)
      [32m+[0m[0m content_sha1         = (known after apply)
      [32m+[0m[0m content_sha256       = (known after apply)
      [32m+[0m[0m content_sha512       = (known after apply)
      [32m+[0m[0m directory_permission = "0700"
      [32m+[0m[0m file_permission      = "600"
      [32m+[0m[0m filename             = "kube-baphomet_kubeconfig.yaml"
      [32m+[0m[0m id                   = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.agent_config["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agent_config["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agent_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
          [32m+[0m[0m "config"   = (sensitive value)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["0-0-worker-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["1-0-worker-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.agents["2-0-worker-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "agents" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "agent_id" = (known after apply)
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = "107336947"
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = "107336945"
        }
    }

[1m  # module.kube-hetzner.null_resource.authentication_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "authentication_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "authentication_config" = "da39a3ee5e6b4b0d3255bfef95601890afd80709"
          [32m+[0m[0m "control_plane_id"      = "107336946"
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = "107336947"
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = "107336945"
        }
    }

[1m  # module.kube-hetzner.null_resource.control_plane_config["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_plane_config" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "config"           = (sensitive value)
          [32m+[0m[0m "control_plane_id" = "107336946"
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["0-0-control-plane-0"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = "107336947"
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["1-0-control-plane-1"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = "107336945"
        }
    }

[1m  # module.kube-hetzner.null_resource.control_planes["2-0-control-plane-2"][0m will be created
[0m  [32m+[0m[0m resource "null_resource" "control_planes" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "control_plane_id" = "107336946"
        }
    }

[1m  # module.kube-hetzner.null_resource.first_control_plane[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "first_control_plane" {
      [32m+[0m[0m id = (known after apply)
    }

[1m  # module.kube-hetzner.null_resource.kustomization[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "kustomization" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "helm_values_yaml" = (sensitive value)
          [32m+[0m[0m "options"          = <<-EOT
                period=5m
                post-reboot-node-labels=kured=done
                pre-reboot-node-labels=kured=rebooting
                reboot-command=/usr/bin/systemctl reboot
                reboot-sentinel=/sentinel/reboot-required
            EOT
          [32m+[0m[0m "versions"         = <<-EOT
                v1.30
                N/A
                v1.30.3
                N/A
                N/A
                N/A
                N/A
                1.15.1
                N/A
                N/A
                N/A
            EOT
        }
    }

[1m  # module.kube-hetzner.random_password.k3s_token[0m will be created
[0m  [32m+[0m[0m resource "random_password" "k3s_token" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 48
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # module.kube-hetzner.random_password.rancher_bootstrap[0][0m will be created
[0m  [32m+[0m[0m resource "random_password" "rancher_bootstrap" {
      [32m+[0m[0m bcrypt_hash = (sensitive value)
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m length      = 48
      [32m+[0m[0m lower       = true
      [32m+[0m[0m min_lower   = 0
      [32m+[0m[0m min_numeric = 0
      [32m+[0m[0m min_special = 0
      [32m+[0m[0m min_upper   = 0
      [32m+[0m[0m number      = true
      [32m+[0m[0m numeric     = true
      [32m+[0m[0m result      = (sensitive value)
      [32m+[0m[0m special     = false
      [32m+[0m[0m upper       = true
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = "kube-baphomet-worker-0-tfr.baphomet.cloud"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = [
          [32m+[0m[0m 2381903,
        ]
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "hel1"
      [32m+[0m[0m name                       = "kube-baphomet-worker-0-tfr"
      [32m+[0m[0m placement_group_id         = 1126793
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx22"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = [
          [32m+[0m[0m "101168964",
        ]
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = "4tT+Pvrjn3ZUFvVhSdCpEycnSfU="
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.0.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = "11372842-10.0.0.0/16"
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["0-0-worker-0"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = "kube-baphomet-worker-1-rve.baphomet.cloud"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = [
          [32m+[0m[0m 2381903,
        ]
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "nbg1"
      [32m+[0m[0m name                       = "kube-baphomet-worker-1-rve"
      [32m+[0m[0m placement_group_id         = 1126793
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx32"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = [
          [32m+[0m[0m "101168964",
        ]
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = "415mNSncW5zJMjQS+UjoQcN3h3A="
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.1.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = "11372842-10.1.0.0/16"
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["1-0-worker-1"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_rdns.server[0][0m will be created
[0m  [32m+[0m[0m resource "hcloud_rdns" "server" {
      [32m+[0m[0m dns_ptr    = "kube-baphomet-worker-2-cub.baphomet.cloud"
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m ip_address = (known after apply)
      [32m+[0m[0m server_id  = (known after apply)
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server" "server" {
      [32m+[0m[0m allow_deprecated_images    = false
      [32m+[0m[0m backup_window              = (known after apply)
      [32m+[0m[0m backups                    = false
      [32m+[0m[0m datacenter                 = (known after apply)
      [32m+[0m[0m delete_protection          = false
      [32m+[0m[0m firewall_ids               = [
          [32m+[0m[0m 2381903,
        ]
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m ignore_remote_firewall_ids = false
      [32m+[0m[0m image                      = "311967250"
      [32m+[0m[0m ipv4_address               = (known after apply)
      [32m+[0m[0m ipv6_address               = (known after apply)
      [32m+[0m[0m ipv6_network               = (known after apply)
      [32m+[0m[0m keep_disk                  = false
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "cluster"     = "kube-baphomet"
          [32m+[0m[0m "engine"      = "k3s"
          [32m+[0m[0m "provisioner" = "terraform"
          [32m+[0m[0m "role"        = "agent_node"
        }
      [32m+[0m[0m location                   = "fsn1"
      [32m+[0m[0m name                       = "kube-baphomet-worker-2-cub"
      [32m+[0m[0m placement_group_id         = 1126793
      [32m+[0m[0m primary_disk_size          = (known after apply)
      [32m+[0m[0m rebuild_protection         = false
      [32m+[0m[0m server_type                = "cx32"
      [32m+[0m[0m shutdown_before_deletion   = false
      [32m+[0m[0m ssh_keys                   = [
          [32m+[0m[0m "101168964",
        ]
      [32m+[0m[0m status                     = (known after apply)
      [32m+[0m[0m user_data                  = "CfjTg69gxnG8gXMXwcDxCLaXVHA="
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].hcloud_server_network.server[0m will be created
[0m  [32m+[0m[0m resource "hcloud_server_network" "server" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m ip          = "10.2.0.101"
      [32m+[0m[0m mac_address = (known after apply)
      [32m+[0m[0m server_id   = (known after apply)
      [32m+[0m[0m subnet_id   = "11372842-10.2.0.0/16"
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.registries[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "registries" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "registries" = " "
        }
    }

[1m  # module.kube-hetzner.module.agents["2-0-worker-2"].null_resource.zram[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "zram" {
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m triggers = {
          [32m+[0m[0m "zram_size" = [90mnull[0m[0m
        }
    }

[1m  # module.kube-hetzner.module.control_planes["0-0-control-plane-0"].hcloud_rdns.server[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_rdns" "server" {
      [33m~[0m[0m dns_ptr    = "static.37.238.201.195.clients.your-server.de" [33m->[0m[0m "kube-baphomet-control-plane-0-wad.baphomet.cloud"
        id         = "s-107336947-195.201.238.37"
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1m  # module.kube-hetzner.module.control_planes["1-0-control-plane-1"].hcloud_rdns.server[0][0m will be updated in-place
[0m  [33m~[0m[0m resource "hcloud_rdns" "server" {
      [33m~[0m[0m dns_ptr    = "static.8.148.245.188.clients.your-server.de" [33m->[0m[0m "kube-baphomet-control-plane-1-lxe.baphomet.cloud"
        id         = "s-107336945-188.245.148.8"
        [90m# (2 unchanged attributes hidden)[0m[0m
    }

[1mPlan:[0m 43 to add, 2 to change, 0 to destroy.
[0m[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

*Pushed by @muchasxmaracas, Action: `pull_request`*